Autodesk.Revit.DB.Mechanical.MEPSection.Velocity
The velocity of the section.
Remarks:
In one section, all section members have same flow.
Default unit is Feet per second.
For Duct, unit type is UT_HVAC_Velocity.
For Pipe, unit type is UT_Piping_Velocity
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.Friction
The friction of the section.
Remarks:
In one section, all section members have same flow.
Default unit is Feet of Water (60 °F) per 100 feet.
For Duct, unit type is UT_HVAC_Friction.
For Pipe, unit type is UT_Piping_Friction
Since:
2013